package com.hzw.signcalendarprogect;

import java.util.Random;

public class shige {
    private String[] shige=new String[]{"别如斯,落尽梨花月又西。——纳兰性德《采桑子》","莫把琼花比澹妆，谁似白霓裳。别样清幽，自然标格，莫近东墙。冰肌玉骨天分付，兼付与凄凉。可怜遥夜，冷烟和月，疏影横窗。——纳兰性德《眼儿媚咏梅》","我是人间惆怅客,知君何事泪纵横,断肠声里忆平生。——纳兰性德《浣溪沙》","然诺重，君须记。——纳兰容若","骊山语罢清宵半，泪雨霖铃终不怨。——纳兰容若《木兰辞》","西风一夜剪芭蕉。倦眼经秋耐寂寥?强把心情付浊醪。读《离骚》。愁似湘江日夜潮。——纳兰容若《忆王孙》","拨灯书尽红笺也，依旧无聊。玉漏迢迢，梦里寒花隔玉萧。几竿修竹三更雨，叶叶萧萧。分付秋潮，莫误双鱼到谢桥。——纳兰容若《采桑子》","忆来何事最销魂，第一折枝花样画罗裙。——纳兰性德《虞美人》","冷香萦遍红桥梦，梦觉城笳。月上桃花，雨歇春寒燕子家。箜篌别后谁能鼓，肠断天涯。暗损韶华，一缕茶烟透碧纱。——纳兰容若《采桑子》","谁省?谁省?从此簟纹灯影——纳兰容若《如梦令》","西风乍起,?励志，人间天上!除却我心而外，芸芸谁会秋凉。不忍见萧萧黄叶，匆忙忙闭锁疏窗。闭锁疏窗，几多旧事，几度思量。当年春光窄窄，春睡足足，春意芳芳。与你诗词时垒，酒浓茶醉，胜若为你梳妆。而今只影空怀远，不解香魂何处。只道是当时笑语，当时乐事，非是寻常。——纳兰容若《如鱼饮水，冷暖自知》","风也萧萧，雨也萧萧，瘦尽灯花又一宵。——纳兰性德","一生恰如三月花，倾我一生一世念，来如飞花散似烟醉里不知年华限，当时花前风连翩几轮春光如玉颜清风不解语，怎知风光恋一样花开一千年，独看沧海化桑田一笑望穿一千年，笑对繁华尘世间轻叹柳老不吹绵，知君到身边-——纳兰容若","春情只到梨花薄，片片催零落。夕阳何事近黄昏，不道人间犹有未招魂。银笺别梦当时句，密绾同心苣。为伊判作梦中人，长向画图清夜唤真真。——纳兰容若《虞美人》","西风多少恨，吹不散眉弯——纳兰容若《临江仙.寒柳》","一往情深深几许?深山夕照深秋雨。——纳兰性德《蝶恋花出塞》","山一程，水一程，身向榆关那畔行，夜深千帐灯。风一更，雪一更，聒碎乡心梦不成，故园无此声。——纳兰容若《长相思》","人生若只如初见，何事秋风悲画扇。等闲变却故人心，却道故心人易变。——纳兰容若《木兰词拟古决绝词柬友》","谢却茶靡，一片月明如水。篆香消,犹未睡，早鸦啼。嫩寒无赖罗衣薄，休傍阑杆角.最愁人，灯欲落，雁还飞。——纳兰容若《酒泉子》","读《离骚》。洗尽秋江日夜潮。——纳兰容若《忆王孙》","聒碎乡心梦不成。——纳兰容若","被酒莫惊春睡重。赌书消得泼茶香——纳兰性德","薄情转是多情累，曲曲柔肠碎，红筏向壁字模糊，忆共灯前呵手为伊书——纳兰容若《虞美人秋夕信步》","土花曾染湘娥黛，铅泪难消。清韵谁敲，不是犀椎是凤翘。只应长伴端溪紫，割取秋潮。鹦鹉偷教，方响前头见玉萧。——纳兰容若《采桑子》","严宵拥絮频惊起，扑面霜空。斜汉朦胧，冷逼毡帷火不红。香篝翠被浑闲事，回首西风。何处疏钟，一穗灯花似梦中。——纳兰容若《采桑子》","方悔从前真草草，等闲看。——纳兰性德","新寒中酒敲窗雨，残香细袅秋情绪。才道莫伤神，青衫湿一痕。无聊成独卧，弹指韶光过。记得别伊时，桃花柳万丝。——纳兰性德《菩萨蛮》","近来无限伤心事，谁与话长更?——纳兰容若《青衫湿悼亡》","萧瑟兰成看老去。为怕多情，不作怜花句。阁泪倚花愁不语，暗香飘尽知何处。重到旧时明月路。袖口香寒，心比秋莲苦。休说生生花里住，惜花人去花无主。——纳兰性德《蝶恋花》","浮生如此，别多会少，不如莫遇。——纳兰容若《纳兰词》","肠断月明红豆蔻，月似当时，人似当时否?——纳兰性德《鬓云松令》","一生一代一双人，争教两处销魂。相思相望不相亲，天为谁春?——纳兰性德《画堂春》","人生恰如三月花，倾我一生一世念。来如飞花散似烟，醉里不知年华限。——纳兰性德《纳兰词》","人生若只如初见，何事秋风悲画扇?——纳兰容若《木兰辞.拟古决绝词柬友》","江南好，建业旧长安。紫盖忽临双?渡，翠华争拥六龙看，雄丽却高寒。——纳兰容若《忆江南》","一片冷香惟有梦，十分清瘦更无诗。标格早梅知。——纳兰性德","为伊判作梦中人，长向画图清夜唤真真。——纳兰容若《虞美人》","木兰词作者：清?纳兰性德人生若只如初见何事秋风悲画扇等闲变却故人心却道故人心易变骊山语罢清宵半泪雨零铃终不怨何如薄幸锦衣郎比翼连枝当日愿——纳兰性德《木兰词》","绿阔千红无处觅，缘何只遇凋残。一声诗韵锁窗寒。由来舟不系，因果总相关。本是云台清净客，相逢怎在秋山。来时容易去时难。任凭风做主，长伴月儿弯。——纳兰容若《临江仙?寒柳》"};

    public String getshige(){
        int p=shige.length;
        Random r=new Random();
        int n2 = r.nextInt(p);
        return shige[n2];
    }



}
